sandwichr/app/controllers/sandwiches_controller.rb

	def show
	  sandwich = Sandwich.find_by(id: params[:id])
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]

	def add
		sandwich = Sandwich.find_by(id: params[:id])
		unless sandwich
	    render json: {error: "sandwich not found"},
	    status: 404
	    return
	  end
		ingredient = Ingredient.find_by(id: params[:ingredient_id])
		unless ingredient
	    render json: {error: "ingredient not found"},
	    status: 404
	    return
	  end
		sandwich.ingredients.push(ingredient)
---
SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "sandwiches" SET "total_calories" = ?, "updated_at" = ? WHERE "sandwiches"."id" = ?  [["total_calories", 120], ["updated_at", "2016-05-09 13:29:31.328356"], ["id", 1]]