video-games-tournament/app/controllers/api/players_controller.rb

SELECT "players".* FROM "players"
---
  def index
    players = Player.all