video-games-tournament/app/controllers/api/tournaments_controller.rb

  def create
    tournament = Tournament.create(tournament_params)
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Tournament 11"], ["created_at", "2016-05-09 14:53:43.482137"], ["updated_at", "2016-05-09 14:53:43.482137"]]

  def show
    tournament = Tournament.find(params[:id])
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 1]]

  def destroy
    tournament = Tournament.find(params[:id])
    tournament.destroy
---
SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "tournaments" WHERE "tournaments"."id" = ?  [["id", 14]]